JIS_KEY_TO_KANA = {
            'q': 'た', 'w': 'て', 'e': 'い', 'r': 'す', 't': 'か', 'y': 'ん', 'u': 'な', 'i': 'に', 'o': 'ら', 'p': 'せ', '@': '゛', '[': '゜',
            'a': 'ち', 's': 'と', 'd': 'し', 'f': 'は', 'g': 'き', 'h': 'く', 'j': 'ま', 'k': 'の', 'l': 'り', ';': 'れ', ':': 'け', ']': 'む',
            'z': 'つ', 'x': 'さ', 'c': 'そ', 'v': 'ひ', 'b': 'こ', 'n': 'み', 'm': 'も', ',': 'ね', '.': 'る', '/': 'め', '_': 'ろ',
            '1': 'ぬ', '2': 'ふ', '3': 'あ', '4': 'う', '5': 'え', '6': 'お', '7': 'や', '8': 'ゆ', '9': 'よ', '0': 'わ', '-': 'ほ', '^': 'へ', '|': 'ー'
        }

KANA_TO_SHIFT_KEY = {
            'ヌ': '!', 'フ': '"', 'ア': '#', 'ウ': '$', 'エ': '%', 'オ': '&', 'ヤ': "'", 'ユ': '(', 'ヨ': ')', 'ワ': '0',
            'ホ': '=', 'ヘ': '~', 'ー': '|',
            'チ': 'A', 'ト': 'S', 'シ': 'D', 'ハ': 'F', 'キ': 'G', 'ク': 'H', 'マ': 'J', 'ノ': 'K', 'リ': 'L', 'レ': '+', 'ケ': '*', 'ム': '}',
            'タ': 'Q', 'テ': 'W', 'イ': 'E', 'ス': 'R', 'カ': 'T', 'ン': 'Y', 'ナ': 'U', 'ニ': 'I', 'ラ': 'O', 'セ': 'P', '濁': '`', '半': '{',
            'ツ': 'Z', 'サ': 'X', 'ソ': 'C', 'ヒ': 'V', 'コ': 'B', 'ミ': 'N', 'モ': 'M', 'ネ': '<', 'ル': '>', 'メ': '?', 'ロ': '_'
        }

KANA_TO_ROMAJI_TABLE = {
            'あ':'a', 'い':'i', 'う':'u', 'え':'e', 'お':'o',
            'か':'ka', 'き':'ki', 'く':'ku', 'け':'ke', 'こ':'ko',
            'さ':'sa', 'し':'shi', 'す':'su', 'せ':'se', 'そ':'so',
            'た':'ta', 'ち':'chi', 'つ':'tsu', 'て':'te', 'と':'to',
            'な':'na', 'に':'ni', 'ぬ':'nu', 'ね':'ne', 'の':'no',
            'は':'ha', 'ひ':'hi', 'ふ':'hu', 'へ':'he', 'ほ':'ho',
            'ま':'ma', 'み':'mi', 'む':'mu', 'め':'me', 'も':'mo',
            'や':'ya', 'ゆ':'yu', 'よ':'yo',
            'ら':'ra', 'り':'ri', 'る':'ru', 'れ':'re', 'ろ':'ro',
            'わ':'wa', 'を':'wo', 'ん':'n',
            'ー':'-'
        }

ROMAJI_TO_KANA_TABLE = {v: k for k, v in KANA_TO_ROMAJI_TABLE.items()}

KANA_TO_JIS_KEY = {v: k for k, v in JIS_KEY_TO_KANA.items()}

CONSONANTS = "bcdfghjklmnpqrstvwxyz"

VOWELS_MAP = {1: 'A', 2: 'I', 3: 'U', 4: 'E', 0: 'O'}

CHARSET = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789!#$-_"

SPECIAL_CHARS = ["!",'"',"#","$","%","&","'","(",")","*","+",",","-",".","/",":",";","<","=",">","?","_","}","~","|","^"]